Terraform Plan (preview)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool_ui_customization.mbm_spa will be created
  + resource "aws_cognito_user_pool_ui_customization" "mbm_spa" {
      + client_id          = "65deq7q3ep2mk0kt7k1o9varh7"
      + creation_date      = (known after apply)
      + css                = <<-EOT
            /* Cognito Hosted UI overrides to match SPA theme */
            /* Tip: Cognito injects this CSS into the Hosted UI. Use high-specificity selectors. */
            /* Limited DOM control – avoid relying on deep structures that may change. */
            
            /* Base */
            html, body {
              background: hsl(340 100% 98%) !important; /* matches --background */
              color: hsl(340 15% 25%) !important;      /* matches --foreground */
              font-family: Inter, system-ui, -apple-system, 'Segoe UI', Roboto, 'Helvetica Neue', Arial !important;
            }
            
            /* Headings */
            h1, h2, h3, h4, h5, h6, .title, .heading {
              color: hsl(334 46% 33%) !important; /* --brand-fg */
              font-family: 'Poppins', system-ui, -apple-system, 'Segoe UI', Roboto, 'Helvetica Neue', Arial !important;
            }
            
            /* Card/container */
            .container, .amplify-container, .amplify-authenticator, .sign-in {
              background: white !important;
              border: 1px solid hsl(320 30% 90%) !important; /* --border */
              border-radius: 14px !important;
              box-shadow: 0 4px 20px -2px rgba(198,166,255,0.15) !important; /* --shadow-card */
            }
            
            /* Inputs */
            input, select, textarea {
              background: hsl(320 30% 95%) !important; /* --input */
              border: 1px solid hsl(320 30% 90%) !important; /* --border */
              border-radius: 10px !important;
            }
            
            /* Primary button */
            button, .amplify-button, input[type="submit"], .btn, .btn-primary {
              background: hsl(330 85% 70%) !important; /* --primary */
              color: white !important;                 /* --primary-foreground */
              border-radius: 10px !important;
              border: none !important;
            }
            button:hover, .amplify-button:hover, .btn:hover, .btn-primary:hover {
              filter: brightness(0.98) !important;
            }
            
            /* Links */
            a { color: hsl(334 46% 33%) !important; text-decoration: underline; }
            
            /* Error text */
            .amplify-field__error-message, .error, .alert-error { color: #c62828 !important; }
            
            /* Small helpers for spacing */
            .amplify-flex, .container, .sign-in { padding: 16px !important; }
        EOT
      + css_version        = (known after apply)
      + id                 = (known after apply)
      + image_url          = (known after apply)
      + last_modified_date = (known after apply)
      + user_pool_id       = "us-east-1_ozL9FkbCg"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```